Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/typechecking-with-proptypes_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: typechecking-with-proptypes title: Typechecking With PropTypes permalink: docs/typechecking-with-proptypes.html redirect_from:
ja: --- id: typechecking-with-proptypes title: PropTypes を用いた型チェック permalink: docs/typechecking-with-proptypes.html redirect_from:

source: > Note: > > `React.PropTypes` has moved into a different package since React v15.5.
ja: > 注意: > > React.PropTypes は React v15.5 において別パッケージに移動しました。

source: Please use [the `prop-types` library instead](https://www.npmjs.com/package/prop-types).
ja: 代わりに [`prop-types` ライブラリ](https://www.npmjs.com/package/prop-types)を利用するようにしてください。

source: > >We provide [a codemod script](/blog/2017/04/07/react-v15.5.0.html#migrating-from-reactproptypes) to automate the conversion.
ja: > > コードを自動で変換するための [codemod スクリプト](/blog/2017/04/07/react-v15.5.0.html#migrating-from-reactproptypes)を提供しています。

source: As your app grows, you can catch a lot of bugs with typechecking.
ja: アプリケーションが成長するにつれて、型チェックによって多くの不具合を見つけられるようになります。

source: For some applications, you can use JavaScript extensions like [Flow](https://flow.org/) or [TypeScript](https://www.typescriptlang.org/) to typecheck your whole application.
ja: アプリケーションによっては、[Flow](https://flow.org/) もしくは [TypeScript](https://www.typescriptlang.org/) のような JavaScript 拡張を使ってアプリケーション全体の型チェックを行うことができるでしょう。

source: But even if you don't use those, React has some built-in typechecking abilities.
ja: しかしそれらを使用せずとも、React は組み込みの型チェック機能を備えています。

source: To run typechecking on the props for a component, you can assign the special `propTypes` property:
ja: コンポーネントの props に型チェックを行うために、特別な `propTypes` プロパティを割当てることができます。

source: In this example, we are using a class component, but the same functionality could also be applied to function components, or components created by [`React.memo`](/docs/react-api.html#reactmemo) or [`React.forwardRef`](/docs/react-api.html#reactforwardref).
ja: この例ではクラスコンポーネントを使っていますが、同様の機能は関数コンポーネントや [`React.memo`](/docs/react-api.html#reactmemo) および [`React.forwardRef`](/docs/react-api.html#reactforwardref) で作ったコンポーネントでも使用できます。

source: `PropTypes` exports a range of validators that can be used to make sure the data you receive is valid.
ja: `PropTypes` は受け取ったデータが有効かどうかを確認するために使用できる種々のバリデーターをエクスポートしています。

source: In this example, we're using `PropTypes.string`.
ja: 上記の例では、`PropTypes.string` を使用しています。

source: When an invalid value is provided for a prop, a warning will be shown in the JavaScript console.
ja: 無効な値がプロパティに与えられた場合、JavaScript のコンソールに警告文が出力されます。

source: For performance reasons, `propTypes` is only checked in development mode.
ja: パフォーマンス上の理由から、`propTypes` のチェックは開発モードでのみ行われます。

source: Here is an example documenting the different validators provided:
ja: PropTypes によって提供されている様々なバリデーターの実例を紹介します。

source: ### Requiring Single Child {#requiring-single-child}
ja: ### 単一の子要素を要求する {#requiring-single-child}

source: With `PropTypes.element` you can specify that only a single child can be passed to a component as children.
ja: `PropTypes.element` を使うことで、コンポーネントに単一の子要素しか渡せないことを指定することができます。

source: ### Default Prop Values {#default-prop-values}
ja: ### props のデフォルト値 {#default-prop-values}

source: You can define default values for your `props` by assigning to the special `defaultProps` property:
ja: `defaultProps` というプロパティを割り当てることで、`props` に値が渡されなかった際のデフォルト値を定義することができます。

source: If you are using a Babel transform like [transform-class-properties](https://babeljs.io/docs/plugins/transform-class-properties/) , you can also declare `defaultProps` as static property within a React component class.
ja: もし、[transform-class-properties](https://babeljs.io/docs/plugins/transform-class-properties/) のような Babel 変換のプラグインを使用している場合、`defaultProps` をクラス内の static プロパティとして定義することができます。

source: This syntax has not yet been finalized though and will require a compilation step to work within a browser.
ja: この記法はまだ TC39 によって確定されていないため、ブラウザ上で正しく表示させるには、Babel 等で変換する必要があります。

source: For more information, see the [class fields proposal](https://github.com/tc39/proposal-class-fields).
ja: 詳細は [class fields proposal](https://github.com/tc39/proposal-class-fields) を参照してください。

source: The `defaultProps` will be used to ensure that `this.props.name` will have a value if it was not specified by the parent component.
ja: `defaultProps` を使えば、`this.props.name` が親コンポーネントから値が指定されなかった場合でも値が代入されていることを保証できます。

source: The `propTypes` typechecking happens after `defaultProps` are resolved, so typechecking will also apply to the `defaultProps`.
ja: `propTypes` による型チェックは `defaultProps` が解決した後に行われるため、`defaultProps` にも型チェックが適用されます。

source: ### Function Components {#function-components}
ja: ### 関数コンポーネント {#function-components}

source: If you are using function components in your regular development, you may want to make some small changes to allow PropTypes to be properly applied.
ja: 普段の開発で関数コンポーネントを利用している場合、正しく PropTypes が適用されるように小さな変更を加える必要があるかもしれません。

source: Let's say you have a component like this:
ja: 以下のようなコンポーネントがあるとしましょう：

source: To add PropTypes, you may want to declare the component in a separate function before exporting, like this:
ja: PropTypes を加えるためには、エクスポートする前にコンポーネントを以下のように別の関数として宣言する必要があります：

source: Then, you can add PropTypes directly to the `HelloWorldComponent`:
ja: これで `HelloWorldComponent` に PropTypes を加えることができるようになります：
